Import dependencies

In [1]:
import os
import pandas as pd

Study data files: Toronto files:

In [2]:
toronto_Q1_path = os.path.join("../resources/1_toronto_canada","2019-Q1.csv")
toronto_Q2_path = os.path.join("../resources/1_toronto_canada", "2019-Q2.csv")
toronto_Q3_path = os.path.join("../resources/1_toronto_canada", "2019-Q3.csv")
toronto_Q4_path = os.path.join("../resources/1_toronto_canada", "2019-Q4.csv")

Read the data and study the results:

In [3]:
q1 = pd.read_csv(toronto_Q1_path, encoding="utf=8")
q2 = pd.read_csv(toronto_Q2_path, encoding="utf=8")
q3 = pd.read_csv(toronto_Q3_path, encoding="utf=8")
q4 = pd.read_csv(toronto_Q4_path, encoding="utf=8")

Renaming the columns:

In [4]:
q1 = q1.rename(columns={"Trip  Duration": "Trip Duration"})
q2 = q2.rename(columns={"Trip  Duration": "Trip Duration"})
q3 = q3.rename(columns={"Trip  Duration": "Trip Duration"})
q4 = q4.rename(columns={"Trip  Duration": "Trip Duration"})

Creating DataFrame:

In [5]:
Toronto = [q1, q2, q4]
bike_share = pd.concat(Toronto)
bike_share.head()

,Trip Id,Subscription Id,Trip Duration,Start Station Id,Start Time,Start Station Name,End Station Id,End Time,End Station Name,Bike Id,User Type
0,4581278,199751,1547,7021,01/01/2019 00:08,Bay St / Albert St,7233.0,01/01/2019 00:33,King / Cowan Ave - SMART,1296,Annual Member
1,4581279,294730,1112,7160,01/01/2019 00:10,King St W / Tecumseth St,7051.0,01/01/2019 00:29,Wellesley St E / Yonge St (Green P),2947,Annual Member
2,4581280,197252,589,7055,01/01/2019 00:15,Jarvis St / Carlton St,7013.0,01/01/2019 00:25,Scott St / The Esplanade,2293,Annual Member
3,4581281,171700,259,7012,01/01/2019 00:16,Elizabeth St / Edward St (Bus Terminal),7235.0,01/01/2019 00:20,Bay St / College St (West Side) - SMART,283,Annual Member
4,4581282,306314,281,7041,01/01/2019 00:19,Edward St / Yonge St,7257.0,01/01/2019 00:24,Dundas St W / St. Patrick St,1799,Annual Member

Deleting column "Trip Duration,Subscription Id,Start Station Name, End Station Name"

In [6]:
del bike_share['Trip Duration']
del bike_share['Subscription Id']
del bike_share['Start Station Name']
del bike_share['End Station Name']
bike_share.head()

,Trip Id,Start Station Id,Start Time,End Station Id,End Time,Bike Id,User Type
0,4581278,7021,01/01/2019 00:08,7233.0,01/01/2019 00:33,1296,Annual Member
1,4581279,7160,01/01/2019 00:10,7051.0,01/01/2019 00:29,2947,Annual Member
2,4581280,7055,01/01/2019 00:15,7013.0,01/01/2019 00:25,2293,Annual Member
3,4581281,7012,01/01/2019 00:16,7235.0,01/01/2019 00:20,283,Annual Member
4,4581282,7041,01/01/2019 00:19,7257.0,01/01/2019 00:24,1799,Annual Member

Renaming columns in the created dataframe

In [7]:
bike_share = bike_share.rename(columns={"Start Time": "start_date",
                                        "Trip Id": "tripID",
                                        "Start Station Id":"start_station_id",
                                        "End Station Id":"end_station_id",
                                        "Start Time":"start_date",
                                        "End Time":"end_date",
                                        "Bike Id":"bikeID",
                                        "User Type":"memberTypeID"
                                       })
bike_share.head()

,tripID,start_station_id,start_date,end_station_id,end_date,bikeID,memberTypeID
0,4581278,7021,01/01/2019 00:08,7233.0,01/01/2019 00:33,1296,Annual Member
1,4581279,7160,01/01/2019 00:10,7051.0,01/01/2019 00:29,2947,Annual Member
2,4581280,7055,01/01/2019 00:15,7013.0,01/01/2019 00:25,2293,Annual Member
3,4581281,7012,01/01/2019 00:16,7235.0,01/01/2019 00:20,283,Annual Member
4,4581282,7041,01/01/2019 00:19,7257.0,01/01/2019 00:24,1799,Annual Member

Identify incomplete rows and Drop all rows with missing information

In [8]:
bike_share.count()

tripID              1309164
start_station_id    1309164
start_date          1309164
end_station_id      1308729
end_date            1309164
bikeID              1309164
memberTypeID        1309164
dtype: int64

In [9]:
bike_share = bike_share.dropna()

In [10]:
bike_share.count()

tripID              1308729
start_station_id    1308729
start_date          1308729
end_station_id      1308729
end_date            1308729
bikeID              1308729
memberTypeID        1308729
dtype: int64

In [ ]:
#Add new column:location_id
newyork_df = bike_share.assign(location_id=4)